ver1/frontend/models/TokyomedalQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `tokyo_medal`